spec/cassettes/kvartovi_u_recima.yml

---
- !ruby/struct:VCR::HTTPInteraction
  request: !ruby/struct:VCR::Request
    method: :post
    uri: http://localhost:8282/icCube/xmla
    body: ! "<?xml version=\"1.0\" encoding=\"UTF-8\"?><env:Envelope xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"
      xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:wsdl=\"http://tempuri.org/wsdl/\"
      xmlns:env=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:ins0=\"http://tempuri.org/type\"><env:Body><Execute
      xmlns=\"urn:schemas-microsoft-com:xml-analysis\"><Command> <Statement> <![CDATA[
      select [Measures].[Broj]  on COLUMNS, non empty topcount( [Lokacija].[Kvart].children,
      100,  [Measures].[Broj]) on ROWS from [GOSJAR] ]]> </Statement> </Command> <Properties>
      <PropertyList> <Catalog>GOSJAR</Catalog>\n                        <Format>Multidimensional</Format>
      <AxisFormat>TupleFormat</AxisFormat> </PropertyList> </Properties></Execute></env:Body></env:Envelope>"
    headers:
      soapaction:
      - ! '"urn:schemas-microsoft-com:xml-analysis:Execute"'
      content-type:
      - text/xml;charset=UTF-8
      content-length:
      - '754'
  response: !ruby/struct:VCR::Response
    status: !ruby/struct:VCR::ResponseStatus
      code: 200
      message: OK
    headers:
      expires:
      - Thu, 01-Jan-1970 00:00:00 GMT
      set-cookie:
      - JSESSIONID=1opxb53awsku11g53txru21jz5;Path=/
      content-type:
      - text/xml; charset=utf-8
      transfer-encoding:
      - chunked
      server:
      - Jetty(6.1.25)
    body: ! '<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><Session
      SessionId="f5089506-8b43-4869-a618-536502ba3cca" xmlns="urn:schemas-microsoft-com:xml-analysis"/></soap:Header><soap:Body><ExecuteResponse
      xmlns="urn:schemas-microsoft-com:xml-analysis"><return><root xmlns="urn:schemas-microsoft-com:xml-analysis:mddataset"
      xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><xs:schema
      targetNamespace="urn:schemas-microsoft-com:xml-analysis:mddataset" elementFormDefault="qualified"
      xmlns="urn:schemas-microsoft-com:xml-analysis:mddataset" xmlns:xs="http://www.w3.org/2001/XMLSchema">    <xs:complexType
      name="MemberType">        <xs:sequence>            <xs:any namespace="##targetNamespace"
      minOccurs="0" maxOccurs="unbounded" processContents="skip"/>        </xs:sequence>        <xs:attribute
      name="Hierarchy" type="xs:string"/>    </xs:complexType>    <xs:complexType
      name="PropType">        <xs:sequence>            <xs:element name="Default"
      minOccurs="0"/>        </xs:sequence>        <xs:attribute name="name" type="xs:string"
      use="required"/>        <xs:attribute name="type" type="xs:QName"/>    </xs:complexType>    <xs:complexType
      name="TupleType">        <xs:sequence>            <xs:element name="Member"
      type="MemberType" maxOccurs="unbounded"/>        </xs:sequence>    </xs:complexType>    <xs:complexType
      name="MembersType">        <xs:sequence>            <xs:element name="Member"
      type="MemberType" minOccurs="0" maxOccurs="unbounded"/>        </xs:sequence>        <xs:attribute
      name="Hierarchy" type="xs:string" use="required"/>    </xs:complexType>    <xs:complexType
      name="TuplesType">        <xs:sequence>            <xs:element name="Tuple"
      type="TupleType" minOccurs="0" maxOccurs="unbounded"/>        </xs:sequence>    </xs:complexType>    <xs:group
      name="SetType">        <xs:choice>            <xs:element name="Members" type="MembersType"/>            <xs:element
      name="Tuples" type="TuplesType"/>            <xs:element name="CrossProduct"
      type="SetListType"/>            <xs:element name="Union">                <xs:complexType>                    <xs:group
      ref="SetType" minOccurs="0" maxOccurs="unbounded"/>                </xs:complexType>            </xs:element>        </xs:choice>    </xs:group>    <xs:complexType
      name="SetListType">        <xs:group ref="SetType" minOccurs="0" maxOccurs="unbounded"/>        <xs:attribute
      name="Size" type="xs:unsignedInt"/>    </xs:complexType>    <xs:complexType
      name="OlapInfo">        <xs:sequence>            <xs:element name="CubeInfo">                <xs:complexType>                    <xs:sequence>                        <xs:element
      name="Cube" maxOccurs="unbounded">                            <xs:complexType>                                <xs:sequence>                                    <xs:element
      name="CubeName" type="xs:string"/>                                    <xs:element
      name="LastDataUpdate" minOccurs="0" type="xs:dateTime"/>                                    <xs:element
      name="LastSchemaUpdate" minOccurs="0" type="xs:dateTime"/>                                </xs:sequence>                            </xs:complexType>                        </xs:element>                    </xs:sequence>                </xs:complexType>            </xs:element>            <xs:element
      name="AxesInfo">                <xs:complexType>                    <xs:sequence>                        <xs:element
      name="AxisInfo" maxOccurs="unbounded">                            <xs:complexType>                                <xs:sequence>                                    <xs:element
      name="HierarchyInfo" minOccurs="0" maxOccurs="unbounded">                                        <xs:complexType>                                            <xs:sequence>                                                <xs:any
      namespace="##targetNamespace" minOccurs="0" maxOccurs="unbounded" processContents="skip"/>                                            </xs:sequence>                                            <xs:attribute
      name="name" type="xs:string" use="required"/>                                        </xs:complexType>                                    </xs:element>                                </xs:sequence>                                <xs:attribute
      name="name" type="xs:string"/>                            </xs:complexType>                        </xs:element>                    </xs:sequence>                </xs:complexType>            </xs:element>            <xs:element
      name="CellInfo">                <xs:complexType>                    <xs:choice
      minOccurs="0" maxOccurs="unbounded">                        <xs:any namespace="##targetNamespace"
      minOccurs="0" maxOccurs="unbounded" processContents="skip"/>                    </xs:choice>                </xs:complexType>            </xs:element>        </xs:sequence>    </xs:complexType>    <xs:complexType
      name="Axes">        <xs:sequence>            <xs:element name="Axis" maxOccurs="unbounded">                <xs:complexType>                    <xs:group
      ref="SetType" minOccurs="0" maxOccurs="unbounded"/>                    <xs:attribute
      name="name" type="xs:string"/>                </xs:complexType>            </xs:element>        </xs:sequence>    </xs:complexType>    <xs:complexType
      name="CellData">        <xs:sequence>            <xs:element name="Cell" minOccurs="0"
      maxOccurs="unbounded">                <xs:complexType>                    <xs:sequence>                        <xs:any
      namespace="##targetNamespace" minOccurs="0" maxOccurs="unbounded" processContents="skip"/>                    </xs:sequence>                    <xs:attribute
      name="CellOrdinal" type="xs:unsignedInt" use="required"/>                </xs:complexType>            </xs:element>        </xs:sequence>    </xs:complexType>    <xs:element
      name="root">        <xs:complexType>            <xs:sequence>                <xs:any
      namespace="http://www.w3.org/2001/XMLSchema" processContents="strict" minOccurs="0"/>                <xs:element
      name="OlapInfo" type="OlapInfo" minOccurs="0"/>                <xs:element name="Axes"
      type="Axes" minOccurs="0"/>                <xs:element name="CellData" type="CellData"
      minOccurs="0"/>            </xs:sequence>        </xs:complexType>    </xs:element></xs:schema>

      <OlapInfo><CubeInfo><Cube><CubeName>GOSJAR</CubeName><LastDataUpdate xmlns="http://schemas.microsoft.com/analysisservices/2003/engine">2012-02-09T09:45:32</LastDataUpdate><LastSchemaUpdate
      xmlns="http://schemas.microsoft.com/analysisservices/2003/engine">2012-02-09T09:45:32</LastSchemaUpdate></Cube></CubeInfo><AxesInfo><AxisInfo
      name="Axis0"><HierarchyInfo name="[Measures]"><UName name="[Measures].[MEMBER_UNIQUE_NAME]"
      type="xsd:string"/><Caption name="[Measures].[MEMBER_CAPTION]" type="xsd:string"/><LName
      name="[Measures].[LEVEL_UNIQUE_NAME]" type="xsd:string"/><LNum name="[Measures].[LEVEL_NUMBER]"
      type="xsd:int"/><DisplayInfo name="[Measures].[DISPLAY_INFO]" type="xsd:unsignedInt"/></HierarchyInfo></AxisInfo><AxisInfo
      name="Axis1"><HierarchyInfo name="[Lokacija].[Kvart]"><UName name="[Lokacija].[Kvart].[MEMBER_UNIQUE_NAME]"
      type="xsd:string"/><Caption name="[Lokacija].[Kvart].[MEMBER_CAPTION]" type="xsd:string"/><LName
      name="[Lokacija].[Kvart].[LEVEL_UNIQUE_NAME]" type="xsd:string"/><LNum name="[Lokacija].[Kvart].[LEVEL_NUMBER]"
      type="xsd:int"/><DisplayInfo name="[Lokacija].[Kvart].[DISPLAY_INFO]" type="xsd:unsignedInt"/></HierarchyInfo></AxisInfo><AxisInfo
      name="SlicerAxis"><HierarchyInfo name="[Vrsta].[Vrsta]"><UName name="[Vrsta].[Vrsta].[MEMBER_UNIQUE_NAME]"
      type="xsd:string"/><Caption name="[Vrsta].[Vrsta].[MEMBER_CAPTION]" type="xsd:string"/><LName
      name="[Vrsta].[Vrsta].[LEVEL_UNIQUE_NAME]" type="xsd:string"/><LNum name="[Vrsta].[Vrsta].[LEVEL_NUMBER]"
      type="xsd:int"/><DisplayInfo name="[Vrsta].[Vrsta].[DISPLAY_INFO]" type="xsd:unsignedInt"/></HierarchyInfo><HierarchyInfo
      name="[Razlog prijave].[Razlog]"><UName name="[Razlog prijave].[Razlog].[MEMBER_UNIQUE_NAME]"
      type="xsd:string"/><Caption name="[Razlog prijave].[Razlog].[MEMBER_CAPTION]"
      type="xsd:string"/><LName name="[Razlog prijave].[Razlog].[LEVEL_UNIQUE_NAME]"
      type="xsd:string"/><LNum name="[Razlog prijave].[Razlog].[LEVEL_NUMBER]" type="xsd:int"/><DisplayInfo
      name="[Razlog prijave].[Razlog].[DISPLAY_INFO]" type="xsd:unsignedInt"/></HierarchyInfo><HierarchyInfo
      name="[Ulica].[ulica]"><UName name="[Ulica].[ulica].[MEMBER_UNIQUE_NAME]" type="xsd:string"/><Caption
      name="[Ulica].[ulica].[MEMBER_CAPTION]" type="xsd:string"/><LName name="[Ulica].[ulica].[LEVEL_UNIQUE_NAME]"
      type="xsd:string"/><LNum name="[Ulica].[ulica].[LEVEL_NUMBER]" type="xsd:int"/><DisplayInfo
      name="[Ulica].[ulica].[DISPLAY_INFO]" type="xsd:unsignedInt"/></HierarchyInfo><HierarchyInfo
      name="[Produkt].[Produkt]"><UName name="[Produkt].[Produkt].[MEMBER_UNIQUE_NAME]"
      type="xsd:string"/><Caption name="[Produkt].[Produkt].[MEMBER_CAPTION]" type="xsd:string"/><LName
      name="[Produkt].[Produkt].[LEVEL_UNIQUE_NAME]" type="xsd:string"/><LNum name="[Produkt].[Produkt].[LEVEL_NUMBER]"
      type="xsd:int"/><DisplayInfo name="[Produkt].[Produkt].[DISPLAY_INFO]" type="xsd:unsignedInt"/></HierarchyInfo></AxisInfo></AxesInfo><CellInfo><Value
      name="VALUE"/><FmtValue name="FORMATTED_VALUE" type="xsd:string"/><CellOrdinal
      name="CELL_ORDINAL" type="xsd:unsignedInt"/></CellInfo></OlapInfo><Axes><Axis
      name="Axis0"><Tuples><Tuple><Member Hierarchy="[Measures]"><UName>[Measures].[Broj]</UName><Caption>Broj</Caption><LName>[Measures].[MeasuresLevel]</LName><LNum>0</LNum><DisplayInfo>0</DisplayInfo></Member></Tuple></Tuples></Axis><Axis
      name="Axis1"><Tuples><Tuple><Member Hierarchy="[Lokacija].[Kvart]"><UName>[Lokacija].[kvar].&amp;[15]</UName><Caption>GORNJA
      DUBRAVA</Caption><LName>[Lokacija].[Kvart].[kvar]</LName><LNum>1</LNum><DisplayInfo>0</DisplayInfo></Member></Tuple><Tuple><Member
      Hierarchy="[Lokacija].[Kvart]"><UName>[Lokacija].[kvar].&amp;[20]</UName><Caption>SESVETE</Caption><LName>[Lokacija].[Kvart].[kvar]</LName><LNum>1</LNum><DisplayInfo>131072</DisplayInfo></Member></Tuple><Tuple><Member
      Hierarchy="[Lokacija].[Kvart]"><UName>[Lokacija].[kvar].&amp;[11]</UName><Caption>NOVI
      ZAGREB – ZAPAD</Caption><LName>[Lokacija].[Kvart].[kvar]</LName><LNum>1</LNum><DisplayInfo>131072</DisplayInfo></Member></Tuple><Tuple><Member
      Hierarchy="[Lokacija].[Kvart]"><UName>[Lokacija].[kvar].&amp;[8]</UName><Caption>MAKSIMIR</Caption><LName>[Lokacija].[Kvart].[kvar]</LName><LNum>1</LNum><DisplayInfo>131072</DisplayInfo></Member></Tuple><Tuple><Member
      Hierarchy="[Lokacija].[Kvart]"><UName>[Lokacija].[kvar].&amp;[10]</UName><Caption>NOVI
      ZAGREB – ISTOK</Caption><LName>[Lokacija].[Kvart].[kvar]</LName><LNum>1</LNum><DisplayInfo>131072</DisplayInfo></Member></Tuple><Tuple><Member
      Hierarchy="[Lokacija].[Kvart]"><UName>[Lokacija].[kvar].&amp;[13]</UName><Caption>TRESNJEVKA
      - JUG</Caption><LName>[Lokacija].[Kvart].[kvar]</LName><LNum>1</LNum><DisplayInfo>131072</DisplayInfo></Member></Tuple><Tuple><Member
      Hierarchy="[Lokacija].[Kvart]"><UName>[Lokacija].[kvar].&amp;[18]</UName><Caption>PODSUSED
      – VRAPČE</Caption><LName>[Lokacija].[Kvart].[kvar]</LName><LNum>1</LNum><DisplayInfo>131072</DisplayInfo></Member></Tuple><Tuple><Member
      Hierarchy="[Lokacija].[Kvart]"><UName>[Lokacija].[kvar].&amp;[6]</UName><Caption>GORNJI
      GRAD – MEDVEŠČAK</Caption><LName>[Lokacija].[Kvart].[kvar]</LName><LNum>1</LNum><DisplayInfo>131072</DisplayInfo></Member></Tuple><Tuple><Member
      Hierarchy="[Lokacija].[Kvart]"><UName>[Lokacija].[kvar].&amp;[7]</UName><Caption>TRNJE</Caption><LName>[Lokacija].[Kvart].[kvar]</LName><LNum>1</LNum><DisplayInfo>131072</DisplayInfo></Member></Tuple><Tuple><Member
      Hierarchy="[Lokacija].[Kvart]"><UName>[Lokacija].[kvar].&amp;[9]</UName><Caption>PEŠČENICA
      - ŽITNJAK</Caption><LName>[Lokacija].[Kvart].[kvar]</LName><LNum>1</LNum><DisplayInfo>131072</DisplayInfo></Member></Tuple><Tuple><Member
      Hierarchy="[Lokacija].[Kvart]"><UName>[Lokacija].[kvar].&amp;[14]</UName><Caption>ČRNOMEREC</Caption><LName>[Lokacija].[Kvart].[kvar]</LName><LNum>1</LNum><DisplayInfo>131072</DisplayInfo></Member></Tuple><Tuple><Member
      Hierarchy="[Lokacija].[Kvart]"><UName>[Lokacija].[kvar].&amp;[17]</UName><Caption>STENJEVEC</Caption><LName>[Lokacija].[Kvart].[kvar]</LName><LNum>1</LNum><DisplayInfo>131072</DisplayInfo></Member></Tuple><Tuple><Member
      Hierarchy="[Lokacija].[Kvart]"><UName>[Lokacija].[kvar].&amp;[12]</UName><Caption>TREŠNJEVKA
      – SJEVER</Caption><LName>[Lokacija].[Kvart].[kvar]</LName><LNum>1</LNum><DisplayInfo>131072</DisplayInfo></Member></Tuple><Tuple><Member
      Hierarchy="[Lokacija].[Kvart]"><UName>[Lokacija].[kvar].&amp;[5]</UName><Caption>DONJI
      GRAD</Caption><LName>[Lokacija].[Kvart].[kvar]</LName><LNum>1</LNum><DisplayInfo>131072</DisplayInfo></Member></Tuple><Tuple><Member
      Hierarchy="[Lokacija].[Kvart]"><UName>[Lokacija].[kvar].&amp;[16]</UName><Caption>DONJA
      DUBRAVA</Caption><LName>[Lokacija].[Kvart].[kvar]</LName><LNum>1</LNum><DisplayInfo>131072</DisplayInfo></Member></Tuple><Tuple><Member
      Hierarchy="[Lokacija].[Kvart]"><UName>[Lokacija].[kvar].&amp;[19]</UName><Caption>PODSLJEME
      </Caption><LName>[Lokacija].[Kvart].[kvar]</LName><LNum>1</LNum><DisplayInfo>131072</DisplayInfo></Member></Tuple></Tuples></Axis><Axis
      name="SlicerAxis"><Tuples><Tuple><Member Hierarchy="[Vrsta].[Vrsta]"><UName>[Vrsta].[Vrsta
      prijave]</UName><Caption>Vrsta prijave</Caption><LName>[Vrsta].[Vrsta].[All-L]</LName><LNum>0</LNum><DisplayInfo>5</DisplayInfo></Member><Member
      Hierarchy="[Razlog prijave].[Razlog]"><UName>[Razlog prijave].[Razlog prijave].[Razlog]</UName><Caption>Razlog</Caption><LName>[Razlog
      prijave].[Razlog].[Razlog prijave]</LName><LNum>0</LNum><DisplayInfo>82</DisplayInfo></Member><Member
      Hierarchy="[Ulica].[ulica]"><UName>[Ulica].[Ulice].[Ulica]</UName><Caption>Ulica</Caption><LName>[Ulica].[ulica].[Ulice]</LName><LNum>0</LNum><DisplayInfo>5092</DisplayInfo></Member><Member
      Hierarchy="[Produkt].[Produkt]"><UName>[Produkt].[All-M]</UName><Caption>All-M</Caption><LName>[Produkt].[Produkt].[All-L]</LName><LNum>0</LNum><DisplayInfo>15</DisplayInfo></Member></Tuple></Tuples></Axis></Axes><CellData><Cell
      CellOrdinal="0"><Value xsi:type="xsd:long">3602</Value><FmtValue>3602</FmtValue></Cell><Cell
      CellOrdinal="1"><Value xsi:type="xsd:long">3186</Value><FmtValue>3186</FmtValue></Cell><Cell
      CellOrdinal="2"><Value xsi:type="xsd:long">2829</Value><FmtValue>2829</FmtValue></Cell><Cell
      CellOrdinal="3"><Value xsi:type="xsd:long">2733</Value><FmtValue>2733</FmtValue></Cell><Cell
      CellOrdinal="4"><Value xsi:type="xsd:long">2607</Value><FmtValue>2607</FmtValue></Cell><Cell
      CellOrdinal="5"><Value xsi:type="xsd:long">2607</Value><FmtValue>2607</FmtValue></Cell><Cell
      CellOrdinal="6"><Value xsi:type="xsd:long">2327</Value><FmtValue>2327</FmtValue></Cell><Cell
      CellOrdinal="7"><Value xsi:type="xsd:long">2259</Value><FmtValue>2259</FmtValue></Cell><Cell
      CellOrdinal="8"><Value xsi:type="xsd:long">2148</Value><FmtValue>2148</FmtValue></Cell><Cell
      CellOrdinal="9"><Value xsi:type="xsd:long">2004</Value><FmtValue>2004</FmtValue></Cell><Cell
      CellOrdinal="10"><Value xsi:type="xsd:long">1945</Value><FmtValue>1945</FmtValue></Cell><Cell
      CellOrdinal="11"><Value xsi:type="xsd:long">1696</Value><FmtValue>1696</FmtValue></Cell><Cell
      CellOrdinal="12"><Value xsi:type="xsd:long">1611</Value><FmtValue>1611</FmtValue></Cell><Cell
      CellOrdinal="13"><Value xsi:type="xsd:long">1422</Value><FmtValue>1422</FmtValue></Cell><Cell
      CellOrdinal="14"><Value xsi:type="xsd:long">1356</Value><FmtValue>1356</FmtValue></Cell><Cell
      CellOrdinal="15"><Value xsi:type="xsd:long">1228</Value><FmtValue>1228</FmtValue></Cell></CellData></root></return></ExecuteResponse></soap:Body></soap:Envelope>'
    http_version: '1.1'
