testsrc/main/mondrian/xmla/basic/MDSCHEMA_MEASURES_in.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <SOAP-ENV:Body>
    <Discover xmlns="urn:schemas-microsoft-com:xml-analysis"
        SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">   
    <RequestType>${request.type}</RequestType>
    <Restrictions>
      <RestrictionList>
        <CATALOG_NAME>${catalog.name}</CATALOG_NAME>
        <CUBE_NAME>${cube.name}</CUBE_NAME>
      </RestrictionList>
    </Restrictions>
    <Properties>
      <PropertyList>
        <DataSourceInfo>${data.source.info}</DataSourceInfo>
        <Catalog>${catalog}</Catalog>
        <Format>${format}</Format>
        <Content>${content}</Content>
      </PropertyList>
    </Properties>
    </Discover>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
