testsrc/main/mondrian/xmla/basic/EXECUTE_DrillThrough_in.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Body>
        <Execute xmlns="urn:schemas-microsoft-com:xml-analysis">
        <Command>
        <Statement>
DRILLTHROUGH MAXROWS 3
SELECT {[Customers].[All Customers].[USA].[CA].[Berkeley]} ON 0,
{[Time].[1997]} ON 1
FROM Sales
         </Statement>
        </Command>
        <Properties>
          <PropertyList>
            <Catalog>${catalog}</Catalog>
            <DataSourceInfo>${data.source.info}</DataSourceInfo>
            <Format>Tabular</Format>
            <AxisFormat>TupleFormat</AxisFormat>
          </PropertyList>
        </Properties>
</Execute>
</soapenv:Body>
</soapenv:Envelope>
